In [1]:
import pandas as pd

In [4]:
df1=pd.DataFrame([[1,3,34,54,3],[2,44,3,24,3,],[24,35,6,56,35],[34,53,45,45,5]],columns=['a','b','c','d','e'])

In [5]:
df1

    a   b   c   d   e
0   1   3  34  54   3
1   2  44   3  24   3
2  24  35   6  56  35
3  34  53  45  45   5

In [10]:
df2=pd.DataFrame([[1,3,34,54,3],[2,444,33,224,33,],[24,135,26,56,35],[34,53,45,445,5]],columns=['v','w','x','y','z'])

In [11]:
df2

    v    w   x    y   z
0   1    3  34   54   3
1   2  444  33  224  33
2  24  135  26   56  35
3  34   53  45  445   5

In [12]:
df3=pd.merge(df1,df2,right_on='v',left_on='a')

In [13]:
df3

    a   b   c   d   e   v    w   x    y   z
0   1   3  34  54   3   1    3  34   54   3
1   2  44   3  24   3   2  444  33  224  33
2  24  35   6  56  35  24  135  26   56  35
3  34  53  45  45   5  34   53  45  445   5